//Z71108DR JOB (ACCT),'DB2 RUN',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID,
//             TIME=(1,1)
//RUN      EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=DSND10.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*INPTFILE DD DSN=Z71108.MARI.DATA.PS,DISP=SHR
//SYSTSIN  DD *
   DSN SYSTEM(DBDG)
   RUN  PROGRAM(ACCTDB) PLAN(Z71108) LIB('Z71108.MARI.DB2.LOAD')
   END
 /*
